# ColorWithTransparency Class

---
Color with transparency
SystemObject Autodesk.Revit.DBColorWithTransparency
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ColorWithTransparency : IDisposable

    Public Class ColorWithTransparency
    	Implements IDisposable

    public ref class ColorWithTransparency : IDisposable

    type ColorWithTransparency =
        class
            interface IDisposable
        end
The ColorWithTransparency type exposes the following members.
| Name| Description
---|---|---
| ColorWithTransparency|  color
| ColorWithTransparency(UInt32, UInt32, UInt32, UInt32)|  color
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ColorWithTransparency
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetBlue|  get blue
| GetColor|  get color
| GetGreen|  get green
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetRed|  get red
| GetTransparency|  get transparency
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetBlue|  set blue
| SetColor|  set color
| SetGreen|  set green
| SetRed|  set red
| SetTransparency|  set transparency
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace